In [5]:
import pandas as info

In [8]:
datos = info.read_excel('./DATOS-PRACTICA-CEUNSASB-01.xlsx')

In [9]:
datos.head()

   ORDEN          ESCUELA TIPO DE EJEMPLAR           NOMBRE  CLASE GENERO
0      1  ESCUELA OFICIOS           DNI-EA      RAUL MANUEL   1948      M
1      2  ESCUELA OFICIOS              DNI     BELEN ZULEMA   1980      F
2      3  ESCUELA OFICIOS           DNI-EA  BETSABE AMERICA   1988      F
3      4  ESCUELA OFICIOS           DNI-EA     LUIS ALBERTO   1950      M
4      5  ESCUELA OFICIOS           DNI-EB     LUIS ENRIQUE   1982      M

In [10]:
datos.groupby('ESCUELA').size()

ESCUELA
ESCUELA BACHILLER    4662
ESCUELA INICIAL      3322
ESCUELA OFICIOS      3996
ESCUELA PERIFERIA    2324
dtype: int64

In [11]:
datos.value_counts('NOMBRE')

NOMBRE
JUAN CARLOS        66
MIGUEL ANGEL       50
JOSE LUIS          36
ANA MARIA          33
JORGE LUIS         29
                   ..
FLAVIA JIMENA       1
FLAVIA LISANDRA     1
FLAVIA NATALIA      1
FLAVIA PLACIDA      1
ZULMA NORA          1
Name: count, Length: 10091, dtype: int64